# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-eid'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

# Binaries
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'git'
brew 'gh'
brew 'git'
brew 'gnupg2'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'pkg-config' # https://github.com/driesvints/dotfiles/issues/20
brew 'tree' # List directories in a tree structure
brew 'wget'
brew 'youtube-dl'
brew 'dropbox'


# Development
brew 'imagemagick'
brew 'node'
brew 'nvm'
brew 'vim'
brew 'mailhog'

# Apps
cask 'aerial'
cask 'alfred'
cask 'caffeine'
cask 'docker'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'gpg-suite'
cask 'imageoptim'
cask 'insomnia'
cask 'mysqlworkbench'
cask 'skype'
cask 'slack'
cask 'steam'
cask 'telegram-desktop'
cask 'the-unarchiver'
cask 'tor-browser'
cask 'transmission'
cask 'vlc'
cask 'whatsapp'
cask 'viber'
cask 'itsycal'
cask 'android-file-transfer'
cask 'iterm2'
cask 'spotify'
cask 'fork'
cask 'spectacle'
cask 'cheatsheet'
cask 'visual-studio-code'
cask 'evernote'
cask 'zoomus'
cask 'pycharm'
casl 'libreoffice'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-inconsolata'
cask 'font-inconsolata-dz-for-powerline'
cask 'font-jetbrains-mono'

# Mac App Store
mas install 497799835 # Xcode
mas install 973134470 # Be Focused
mas install 918858936 # AirMail
mas install 1176895641 # Spark
