# Make Homebrew to recognize Brewfiles
tap 'homebrew/bundle'

tap 'caskroom/cask'
tap 'caskroom/fonts'

# Set the applications directory
cask_args appdir: '/Applications'


# Install GNU core utilities (those that come with macOS are outdated)
brew 'coreutils'
# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'
# Install more recent versions of some macOS tools
brew 'grep'

brew 'dockutil'

# Various
brew 'ffmpeg'
brew 'git'
brew 'imagemagick'
brew 'node'
brew 'nvm'
brew 'python'
brew 'mysql'
brew 'mysql-python'
brew 'google-cloud-sdk'
brew 'rbenv'
brew 'wget'
brew 'youtube-dl'
brew 'zsh'
brew 'vim'
brew 'readline'
brew 'zplug' # Zsh plugin manager

# System requirement
cask 'xquartz'

# Browsers
cask 'google-chrome'
cask 'firefox'

# Compression
cask 'the-unarchiver'

# Fonts
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-inconsolata'
cask 'font-inconsolata-dz-for-powerline'

# GPG
brew 'gpg'
brew 'gpg-agent'
brew 'pinentry-mac'

# QuickLook addons
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'
cask 'qlprettypatch'
cask 'suspicious-package'

# Apps
cask 'kaleidoscope'
cask 'itsycal'
cask 'etcher'
cask 'whatsapp'
cask 'transmission'
cask 'dropbox'
cask 'android-file-transfer'
cask 'dash'
cask 'docker'
cask 'insomnia'
cask 'iterm2'
cask 'slack'
cask 'vlc'
cask 'skype'
cask 'spotify'
cask 'daisydisk'
cask 'cheatsheet'
cask 'visual-studio-code'

# Android sdk requirement
cask 'java8'
